In [2]:
import pandas as pd

In [3]:
df= pd.DataFrame([12,34,55,11,10])
df

    0
0  12
1  34
2  55
3  11
4  10

In [4]:
df= pd.DataFrame([[1,9,7,4],[5,6,7,8],[7,5,4,3]])
df

   0  1  2  3
0  1  9  7  4
1  5  6  7  8
2  7  5  4  3

In [6]:
df= pd.DataFrame([[1,9,7,4],[5,6,7,8],[7,5,4,3]], columns=['a','b','c','d'], index=['i','j','k'])
df

   a  b  c  d
i  1  9  7  4
j  5  6  7  8
k  7  5  4  3

In [8]:
df1=pd.DataFrame({'Name':['Sourav','Priyanshu','Simran','Anshu','Arsh','Anurag','Priyanka'],'class':['btech','bca','mca','btech','mcom','mba','bca'],'Rollno':[34,32,11,10,45,67,89]})
df1

        Name  class  Rollno
0     Sourav  btech      34
1  Priyanshu    bca      32
2     Simran    mca      11
3      Anshu  btech      10
4       Arsh   mcom      45
5     Anurag    mba      67
6   Priyanka    bca      89

In [9]:
# functions 
df1.head() # first five rows- by default 5

        Name  class  Rollno
0     Sourav  btech      34
1  Priyanshu    bca      32
2     Simran    mca      11
3      Anshu  btech      10
4       Arsh   mcom      45

In [10]:
df1.head(2)

        Name  class  Rollno
0     Sourav  btech      34
1  Priyanshu    bca      32

In [11]:
df1.tail() # by default last 5

       Name  class  Rollno
2    Simran    mca      11
3     Anshu  btech      10
4      Arsh   mcom      45
5    Anurag    mba      67
6  Priyanka    bca      89

In [12]:
df1.tail(2)

       Name class  Rollno
5    Anurag   mba      67
6  Priyanka   bca      89

In [14]:
# access - [], . , loc, iloc 
df1['Name']

0       Sourav
1    Priyanshu
2       Simran
3        Anshu
4         Arsh
5       Anurag
6     Priyanka
Name: Name, dtype: object

In [16]:
df1.Name

0       Sourav
1    Priyanshu
2       Simran
3        Anshu
4         Arsh
5       Anurag
6     Priyanka
Name: Name, dtype: object

In [51]:
df1[:3]

        Name  class  Rollno
0     Sourav  btech      34
1  Priyanshu    bca      32
2     Simran    mca      11

In [20]:
df1[['Name','class']][1:4]

        Name  class
1  Priyanshu    bca
2     Simran    mca
3      Anshu  btech

In [53]:
df1.Name[:5]

0       Sourav
1    Priyanshu
2       Simran
3        Anshu
4         Arsh
Name: Name, dtype: object

In [21]:
df1[['Name','class','Rollno']]

        Name  class  Rollno
0     Sourav  btech      34
1  Priyanshu    bca      32
2     Simran    mca      11
3      Anshu  btech      10
4       Arsh   mcom      45
5     Anurag    mba      67
6   Priyanka    bca      89

In [22]:
df1.Rollno

0    34
1    32
2    11
3    10
4    45
5    67
6    89
Name: Rollno, dtype: int64

In [56]:
# loc, iloc 
df1.loc[:,:]  # rows, columns

        Name  class  Rollno
0     Sourav  btech      34
1  Priyanshu    bca      32
2     Simran    mca      11
3      Anshu  btech      10
4       Arsh   mcom      45
5     Anurag    mba      67
6   Priyanka    bca      89

In [29]:
df1.loc[:2,:]

        Name  class  Rollno
0     Sourav  btech      34
1  Priyanshu    bca      32
2     Simran    mca      11

In [28]:
df1.iloc[:2,:]

        Name  class  Rollno
0     Sourav  btech      34
1  Priyanshu    bca      32

In [30]:
df1.loc[:4,'Name']

0       Sourav
1    Priyanshu
2       Simran
3        Anshu
4         Arsh
Name: Name, dtype: object

In [63]:
df1.loc[:4,['class','Name']]

   class       Name
0  btech     Sourav
1    bca  Priyanshu
2    mca     Simran
3  btech      Anshu
4   mcom       Arsh

In [37]:
df1.iloc[:4,:2]

        Name  class
0     Sourav  btech
1  Priyanshu    bca
2     Simran    mca
3      Anshu  btech

In [38]:
df1

        Name  class  Rollno
0     Sourav  btech      34
1  Priyanshu    bca      32
2     Simran    mca      11
3      Anshu  btech      10
4       Arsh   mcom      45
5     Anurag    mba      67
6   Priyanka    bca      89

In [43]:
df1.shape

(7, 3)

In [50]:
# add column 
df1.loc[:,'Total Marks']=50
df1['mail']=['palwind@fmai','suman@ foaf','sumit@fic','jatin@fix','akfjajf@gmaim','palwinder@kdjkgfj','palwind']

In [51]:
df1

        Name  class  Rollno  Total Marks               mail  Marks
0     Sourav  btech      34           50       palwind@fmai     44
1  Priyanshu    bca      32           50        suman@ foaf     40
2     Simran    mca      11           50          sumit@fic     42
3      Anshu  btech      10           50          jatin@fix     46
4       Arsh   mcom      45           50      akfjajf@gmaim     49
5     Anurag    mba      67           50  palwinder@kdjkgfj     48
6   Priyanka    bca      89           50            palwind     41

In [54]:
# add column 
df1.loc[:,'Marks']=[44,40,42,46,49,48,41]

In [56]:
df1

        Name  class  Rollno  Total Marks               mail  Marks
0     Sourav  btech      34           50       palwind@fmai     44
1  Priyanshu    bca      32           50        suman@ foaf     40
2     Simran    mca      11           50          sumit@fic     42
3      Anshu  btech      10           50          jatin@fix     46
4       Arsh   mcom      45           50      akfjajf@gmaim     49
5     Anurag    mba      67           50  palwinder@kdjkgfj     48
6   Priyanka    bca      89           50            palwind     41

In [57]:
df1.loc[4,'Marks']=48

In [58]:
df1

        Name  class  Rollno  Total Marks               mail  Marks
0     Sourav  btech      34           50       palwind@fmai     44
1  Priyanshu    bca      32           50        suman@ foaf     40
2     Simran    mca      11           50          sumit@fic     42
3      Anshu  btech      10           50          jatin@fix     46
4       Arsh   mcom      45           50      akfjajf@gmaim     48
5     Anurag    mba      67           50  palwinder@kdjkgfj     48
6   Priyanka    bca      89           50            palwind     41

In [59]:
df1.loc[:,'Total Marks']=70

In [60]:
df1

        Name  class  Rollno  Total Marks               mail  Marks
0     Sourav  btech      34           70       palwind@fmai     44
1  Priyanshu    bca      32           70        suman@ foaf     40
2     Simran    mca      11           70          sumit@fic     42
3      Anshu  btech      10           70          jatin@fix     46
4       Arsh   mcom      45           70      akfjajf@gmaim     48
5     Anurag    mba      67           70  palwinder@kdjkgfj     48
6   Priyanka    bca      89           70            palwind     41

In [62]:
df1.loc[7,:]=['Jatin','btech',44,70,'jatin@gmail.com',46]

In [63]:
df1

        Name  class  Rollno  Total Marks               mail  Marks
0     Sourav  btech    34.0         70.0       palwind@fmai   44.0
1  Priyanshu    bca    32.0         70.0        suman@ foaf   40.0
2     Simran    mca    11.0         70.0          sumit@fic   42.0
3      Anshu  btech    10.0         70.0          jatin@fix   46.0
4       Arsh   mcom    45.0         70.0      akfjajf@gmaim   48.0
5     Anurag    mba    67.0         70.0  palwinder@kdjkgfj   48.0
6   Priyanka    bca    89.0         70.0            palwind   41.0
7      Jatin  btech    44.0         70.0    jatin@gmail.com   46.0

In [85]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         8 non-null      object
 1   class        8 non-null      object
 2   Rollno       8 non-null      float64
 3   Total Marks  8 non-null      float64
 4   Marks        8 non-null      float64
dtypes: float64(3), object(2)
memory usage: 452.0+ bytes

In [64]:
df1.insert(3,column='New',value=1)

In [68]:
df1.loc[4,'New']=2

In [71]:
df1

,Name,class,Rollno,New,Total Marks,mail,Marks,"(4, New)"
0,Sourav,btech,34.0,1,70.0,palwind@fmai,44.0,2
1,Priyanshu,bca,32.0,1,70.0,suman@ foaf,40.0,2
2,Simran,mca,11.0,1,70.0,sumit@fic,42.0,2
3,Anshu,btech,10.0,1,70.0,jatin@fix,46.0,2
4,Arsh,mcom,45.0,2,70.0,akfjajf@gmaim,48.0,2
5,Anurag,mba,67.0,1,70.0,palwinder@kdjkgfj,48.0,2
6,Priyanka,bca,89.0,1,70.0,palwind,41.0,2
7,Jatin,btech,44.0,1,70.0,jatin@gmail.com,46.0,2

In [74]:
df1.drop((4, 'New'),axis=1,inplace=True)

In [75]:
df1

        Name  class  Rollno  New  Total Marks               mail  Marks
0     Sourav  btech    34.0    1         70.0       palwind@fmai   44.0
1  Priyanshu    bca    32.0    1         70.0        suman@ foaf   40.0
2     Simran    mca    11.0    1         70.0          sumit@fic   42.0
3      Anshu  btech    10.0    1         70.0          jatin@fix   46.0
4       Arsh   mcom    45.0    2         70.0      akfjajf@gmaim   48.0
5     Anurag    mba    67.0    1         70.0  palwinder@kdjkgfj   48.0
6   Priyanka    bca    89.0    1         70.0            palwind   41.0
7      Jatin  btech    44.0    1         70.0    jatin@gmail.com   46.0